#include <iostream>
#include <windows.h>
using namespace std;
int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
    int x;
    cout << "Працює інформаційна система факультету прикладної математики:\n";
	cout << "1. Новини дня\n";
	cout << "2. Анекдот тижня\n";
	cout << "3. Автора !!!\n";
	cout << "Введіть відповідний номер і натисніть ENTER. \n";
	cin >> x;
	switch (x)
	{
	case 1:
		cout << "Новини дня: Сьогодні сніжно\n";
		break;
	case 2:
		cout << "Анекдот тижня: Справжній програміст завжди ставить поруч дві склянки: одну з водою — на випадок, якщо захоче пити, а іншу порожню — на випадок, якщо не захоче.\n";
		break;
	case 3:
		cout << "Автор: Натикач Данило Вячеславовчи, студент ПА-25у-1.\n";
		break;
	default:
		cout << "Невірний вибір. Будь ласка, спробуйте ще раз.\n";
		break;
	}
	return 0;
}